Revit 2024 API
ParameterTypeId.AnalyticalModelArea Property
 "Area": The Area of Analytical Model
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId AnalyticalModelArea { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalModelArea As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ AnalyticalModelArea {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace